{
  "posts": [
    {
      "date": "23 Febrero, 2025",
      "title": "Cross-Site Scripting: La Amenaza Invisible en tu Web",
      "description": "Las <strong>vulnerabilidades de Cross-Site Scripting (XSS)</strong> son un riesgo común y peligroso en la seguridad de aplicaciones web. Permiten a atacantes inyectar código JavaScript malicioso en sitios web legítimos para robar información, manipular el comportamiento de la página o suplantar la identidad de usuarios.Esta guía ofrece una visión detallada de los tres tipos principales de XSS: <strong>Stored XSS</strong>, <strong>Reflected XSS</strong> y <strong>DOM-Based XSS</strong>, explicando cómo ocurren, cómo se explotan y cómo prevenirlas.",
      "link": "23-02-2025",
      "lang": "es"
    },
    {
      "date": "16 Febrero, 2025",
      "title": "Introducción a las Plantillas de Nuclei",
      "description": "En este articulo, Exploraremos como funcionan las plantillas de <strong><a href=\"https://docs.projectdiscovery.io/templates/introduction\" target=\"Nuclei\">Nuclei</a></strong> , detallando el <strong>proceso de creación y configuración de vulnerabilidades personalizadas</strong>. Aprenderás los fundamentos, desde la configuración de la información básica y la elaboración de peticiones HTTP precisas hasta el uso de <strong>variables</strong>, <strong>payloads</strong>, <strong>matchers</strong> y <strong>extractors</strong> para pruebas dinámicas. Además, un ejemplo práctico demuestra cómo simular un servidor vulnerable y detectar una vulnerabilidad utilizando una plantilla personalizada <strong>Nuclei</strong>.",
      "link": "16-02-2025",
      "lang": "es"
    },
    {
      "date": "9 Febrero, 2025",
      "title": "Deuda técnica: un mal necesario en el desarrollo de software",
      "description": "En Atlansec, aunque somos principalmente una empresa de ciberseguridad, también abordamos la deuda técnica desde la perspectiva del desarrollo de software seguro y la seguridad de las infraestructuras. Construir código seguro e infraestructuras robustas es clave para reducir las vulnerabilidades y garantizar la mantenibilidad a largo plazo.<br><br>La deuda técnica es un enemigo inevitable que acompaña a todos los proyectos de software en mayor o menor medida. Sin embargo, no siempre es perjudicial y, en algunos casos, puede ser una estrategia necesaria para alcanzar objetivos críticos en un plazo determinado.",
      "link": "09-02-2025",
      "lang": "es"
    },
    {
      "date": "2 Febrero, 2025",
      "title": "La Costosa Lección del Fraude del CEO: La importancia de la Capacitación en Ciberseguridad para Empleados",
      "description": "<strong>16 de Enero de 2016 – Ried im Innkreis, Austria</strong>. En las oficinas de <strong>FACC Operations GmbH</strong> (un fabricante austriaco de componentes aeroespaciales), un <strong>empleado del departamento de finanzas</strong> recibió un correo electrónico urgente que parecía provenir <strong>directamente del CEO de la empresa</strong>.<br><br>La solicitud era clara: se necesitaba una <strong>transferencia de un millón de euros</strong> para finalizar un <strong>\"proyecto estratégico\".</strong>",
      "link": "02-02-2025",
      "lang": "es"
    },
    {
      "date": "19 Enero, 2025",
      "title": "El día que Dependabot conoció a SheetJS",
      "description": "Todo comenzó con una notificación de Dependabot hace unos días. Mientras revisaba un repositorio de un proyecto interno, me encontré con el siguiente mensaje:<div style=\"text-align: center;\"><img src=\"../../../assets/posts/2025/01/19/Dependabot_alert.png\" alt=\"Dependabot_alert\"><figcaption>Alerta de Dependabot</figcaption></div><br>Procedí con el <strong>flujo de trabajo estándar de Dependabot para abordar los problemas</strong>, ya que asumí que era una actualización de rutina. Sin embargo, me sorprendió cuando las correcciones para ambas vulnerabilidades fallaron porque <strong>no se pudo encontrar la versión parcheada requerida.</strong>",
      "link": "19-01-2025",
      "lang": "es"
    },
    {
      "date": "22 Diciembre, 2024",
      "title": "Nueva Ley de Resiliencia Cibernética de la UE",
      "description": "El 23 de octubre de 2024, entró en vigor la <strong>Regulación Europea de Resiliencia Cibernética</strong>, marcando un cambio regulatorio destinado a fortalecer la seguridad digital en toda la Unión Europea. En <strong>Atlansec</strong>, este hito refuerza nuestra misión principal: <strong>crear soluciones y productos digitales que sean seguros durante todo su ciclo de vida y garantizar la protección de los entornos en los que operan.</strong>",
      "link": "22-12-2024",
      "lang": "es"
    },
    {
      "date": "15 Diciembre, 2024",
      "title": "Instalación y Configuración de Herramientas de Análisis en Android",
      "description": "Este artículo describe los pasos necesarios para crear un entorno de pruebas dinámico en Linux/Debian, detallando cómo integrar herramientas como <strong>Burp Suite</strong>, <strong>Frida</strong> y <strong>Objection</strong>, y sus propósitos específicos. También cubre procedimientos para gestionar certificados en un emulador de Android y configurar un entorno de pruebas dinámico. Sigue las instrucciones detalladas para lograr una configuración funcional y lista para el análisis.",
      "link": "15-12-2024",
      "lang": "es"
    },
    {
      "date": "8 Diciembre, 2024",
      "title": "Challenge, Train, Flag: Blueprint Heist",
      "description": "En Atlansec, estamos comprometidos con <strong>los CTFs como una herramienta clave de aprendizaje</strong> bajo la metodología de <em>aprender haciendo</em>. Creemos que <strong>enfrentar desafíos prácticos es la mejor manera de desarrollar habilidades técnicas</strong> y fomentar la creatividad. Con esta sección queremos difundir el valor de los CTFs, compartir <em>writeups</em> de desafíos de cierta complejidad técnica y acercar a la comunidad a un enfoque práctico y técnico del aprendizaje.",
      "link": "08-12-2024",
      "lang": "es"
    },
    {
      "date": "30 Noviembre, 2024",
      "title": "XVIII Jornadas STIC CCN-CERT | VI Jornadas de Ciberdefensa ESPDEF-CERT",
      "description": "El pasado Martes, tuvimos el honor de asistir a la <strong><a href=\"https://jornadas.ccn-cert.cni.es/es/xviiijornadas\"target=\"XVIII Jornadas STIC CCN-CERT | VI Jornadas de Ciberdefensa ESPDEF-CERT\">XVIII Jornadas STIC CCN-CERT | VI Jornadas de Ciberdefensa ESPDEF-CERT</a></strong>, celebradas en los cines Kinépolis de la Ciudad de la Imagen en Madrid. El propósito principal de este viaje fue recibir un premio concedido a nuestro equipo de ciberseguridad, que resultó ganador de una competición nacional organizada por la Universidad de Granada en colaboración con <strong><a href=\"https://youtu.be/w7iuEEjaLYU\" target=\"El Mando Conjunto del Ciberespacio (MCCE)\">El Mando Conjunto del Ciberespacio (MCCE)</a></strong> y el <strong><a href=\"https://www.incibe.es/\" target=\"Instituto Nacional de Ciberseguridad (INCIBE)\">Instituto Nacional de Ciberseguridad (INCIBE)</a></strong>. Este reconocimiento no solo nos llena de orgullo, si no que también refuerza nuestro compromiso con las nuevas generaciones y nuestra confianza en el inmenso talento de estos jóvenes profesionales.",
      "link": "30-11-2024",
      "lang": "es"
    },
    {
      "date": "24 Noviembre, 2024",
      "title": "SMB 101",
      "description":"SMB (Server Message Block) es un protocolo utilizado para compartir recursos como archivos, impresoras y directorios en una red. Utiliza una arquitectura cliente-servidor, donde el servidor pone los recursos a disposición y múltiples clientes pueden acceder a ellos. Aunque SMB3 introduce cifrado para proteger los datos, versiones anteriores como SMB1 transmiten información en texto plano, lo que las hace vulnerables a ciertos ataques.<br><br>En este artículo, nos centraremos en conceptos básicos, comandos clave y ataques comunes relacionados con SMB, destacando el uso de herramientas como <strong>enum4linux</strong> para la enumeración.",
      "link": "24-11-2024",
      "lang": "es"
    },
    {
      "date": "14 Noviembre, 2024",
      "title": "Introducción a FTP",
      "description": "El protocolo FTP (File Transfer Protocol) es un protocolo usado para la transferencia de archivos entre ordenadores en red, este protocolo presenta arquitectura cliente-servidor usándose un servidor para servir archivos que pueden ser accedidos por N clientes. Por defecto, la información se transmite en texto plano, aunque existe una versión cifrada del mismo llamada SFTP (Secure File Transfer Protocol).",
      "link": "14-11-2024",
      "lang": "es"
    },
    {
      "date": "17 Octubre, 2024",
      "title": "Abusando de ssh-keygen",
      "description": "SSH-Keygen es una herramienta que permite crear y gestionar claves SSH, esta herramienta esta presente en la mayoría de los sistemas UNIX hoy en día como herramienta para facilitar la gestión de las claves SSH.<br><br>En este articulo exploraremos un par de métodos para abusar de esta herramienta con ciertas configuraciones como método de persistencia o de escalada de privilegios en el sistema.",
      "link": "17-10-2024",
      "lang": "es"
    }
  ]
}