{
  "posts": [
    {
      "date": "February 9, 2025",
      "title": "Technical Debt: A Necessary Evil in Software Development",
      "description": "At Atlansec, while we are primarily a cybersecurity company, we also address technical debt from the perspective of secure software development and infrastructure security...",
      "link": "09-02-2025"
    },
    {
      "date": "February 2, 2025",
      "title": "The Costly Lesson of CEO Fraud: Why Employee Cybersecurity Training is Crucial",
      "description": "January 16, 2016 – Ried im Innkreis, Austria. At the offices of FACC Operations GmbH, an employee from the finance department received an urgent email that appeared to come directly from the company’s CEO...",
      "link": "02-02-2025"
    },
    {
      "date": "January 26, 2025",
      "title": "Comprehensive Guide to DNS: Overview, Setup & Security",
      "description": "Understanding the Domain Name System (DNS) is essential for anyone interested in how the internet works. DNS plays a crucial role in translating human-friendly domain names into machine-readable IP addresses...",
      "link": "26-01-2025"
    },
    {
      "date": "January 19, 2025",
      "title": "The day that Dependabot met SheetJS",
      "description": "It all started with a notification from Dependabot a few days ago. While reviewing an internal project repository, I encountered the following message...",
      "link": "19-01-2025"
    },
    {
      "date": "December 22, 2024",
      "title": "New EU Cyber Resilience Act",
      "description": "On October 23, 2024, the European Cyber Resilience Regulation came into force, marking a regulatory shift aimed at strengthening digital security across the European Union...",
      "link": "22-12-2024"
    },
    {
      "date": "December 15, 2024",
      "title": "Installation and Configuration of Analysis Tools on Android",
      "description": "This article outlines the necessary steps to create a dynamic testing environment on Linux/Debian, detailing how to integrate tools such as Burp Suite, Frida, and Objection...",
      "link": "15-12-2024"
    },
    {
      "date": "December 8, 2024",
      "title": "Challenge, Train, Flag: Blueprint Heist",
      "description": "At Atlansec, we are committed to CTFs as a key learning tool under the learning by doing methodology. We believe that facing practical challenges is the best way to develop technical skills...",
      "link": "08-12-2024"
    },
    {
      "date": "November 30, 2024",
      "title": "XVIII Jornadas STIC CCN-CERT | VI Jornadas de Ciberdefensa ESPDEF-CERT",
      "description": "Last Tuesday, we had the honor of attending the XVIII Jornadas STIC CCN-CERT | VI Jornadas de Ciberdefensa ESPDEF-CERT, held at the Kinépolis cinemas in Ciudad de la Imagen, Madrid...",
      "link": "30-11-2024"
    },
    {
      "date": "November 24, 2024",
      "title": "SMB 101",
      "description": "SMB (Server Message Block) is a protocol used to share resources such as files, printers, and directories over a network. It uses a client-server architecture, where the server makes resources available...",
      "link": "24-11-2024"
    },
    {
      "date": "November 14, 2024",
      "title": "Intro to FTP",
      "description": "FTP (File Transfer Protocol) is one of the oldest and most widely used protocols for transferring files between computers. While it provides a simple way to move data, its default configuration lacks security...",
      "link": "14-11-2024"
    },
    {
      "date": "October 17, 2024",
      "title": "Abusing ssh-keygen",
      "description": "SSH-Keygen is a tool that allows you to create and manage SSH keys, this tool is present in most UNIX systems today as a tool to facilitate the management of SSH keys...",
      "link": "17-10-2024"
    }
  ]
}
